Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/employment/employment_rights_and_conditions/leave_and_holidays/public_holidays_in_ireland.html.txt.tmx
Source language: en
Languages: pl

source: There are 9 public holidays in Ireland each year
pl: W Irlandii 9 dni w roku jest ustawowo wolnych od pracy

source: Public holidays may commemorate a special day or other event, for example, St Patrick's Day (17 March) or Christmas Day (25 December)
pl: Dni ustawowo wolne od pracy w Irlandii (podobnie jak w innych krajach) mogą upamiętniać jakiś wyjątkowy dzień lub inne wydarzenie, na przykład Dzień Św. Patryka (17 marca) lub Pierwszy dzień Świąt (25 grudnia)

source: On a public holiday, sometimes called a bank holiday, most businesses and schools close
pl: W dni ustawowo wolne od pracy większość zakładów pracy i szkół jest zamknięta, chociaż inne firmy usługowe (np

source: Other services, for example, public transport still operate but often with restricted schedules
pl: zakłady transportu publicznego) są czynne lecz często w ograniczonym zakresie czasowym

source: The list of public holidays each year is as follows:
pl: Lista dni ustawowo wolnych od pracy w Irlandii obejmuje następujące dni:

source: • New Year's Day (1 January)
pl: • Nowy Rok (1 stycznia)

source: • First Monday in May, June, August
pl: • Pierwszy poniedziałek maja, czerwca i sierpnia

source: • Christmas Day (25 December)
pl: • Pierwszy Dzień Świąt Bożego Narodzenia (25 grudnia)

source: Good Friday is not a public holiday
pl: Wielki Piątek nie jest dniem ustawowo wolnym od pracy

source: While some schools and businesses close on that day, you have no automatic entitlement to time off work on that day
pl: Choć w tym dniu szkoły i przedsiębiorstwa są zamknięte, nie oznacza to, że ten dzień jest automatycznie wolny od pracy

source: How is the date of Easter Monday determined each year?
pl: Sposób ustalania daty Poniedziałku Wielkanocnego?

source: Easter Monday is the only public holiday that can vary significantly from year to year
pl: Poniedziałek Wielkanocny jest jedynym dniem ustawowo wolnym od pracy w Irlandii (dotyczy to również innych krajów), który może w każdym roku przypadać w innym dniu

source: The date of Easter moves every year within the international calendar for civil use
pl: Data Świąt Wielkanocnych przesuwana jest co roku w ramach międzynarodowego cywilnego kalendarza

source: Broadly speaking, Easter should be the first Sunday after the first full moon occurring on or after 21 March
pl: Ogólnie rzecz biorąc Wielkanoc powinna wypadać w pierwszą niedzielę po pierwszej pełni księżyca przypadającej 21 marca lub po tej dacie

source: This means that the earliest possible date for Easter Sunday in any year is 22 March, the latest is 25 April
pl: Oznacza to, że najwcześniej Niedziela Wielkanocna może przypaść na 22 marca a najpóźniej 25 kwietnia

source: Easter Monday will fall on the following dates between 2017 and 2020: 17 April 2017, 2 April 2018, 22 April 2019, 13 April 2020
pl: Niedziela Wielkanocna przypada na następujące dni: 6 kwietnia 2015, 28 marca 2016, 17 kwietnia 2017, 2 kwietnia 2018

source: Your entitlement to public holidays is set out in the Organisation of Working Time Act 1997
pl: Prawo do dni ustawowo wolnych od pracy określone jest w Ustawie o organizacji czasu pracy z 1997 roku Większość pracowników ma prawo do pobierania wynagrodzenia za dni ustawowo wolne od pracy

source: Most employees are entitled to paid leave on public holidays
pl: Wyjątkiem są osoby pracujące w niepełnym wymiarze godzin, które nie przepracowały jeszcze min

source: One exception is part-time employees who have not worked for their employer at least 40 hours in total in the 5 weeks before the public holiday
pl: 40 godzin w ciągu 5 tygodni przypadającym przed dniem ustawowo wolnym od pracy

source: Employees who qualify for public holiday benefit will be entitled to one of the following:
pl: Pracownicy, którzy są obcjęci przepisami Ustawy mają prawo do jednego z poniższych:

source: • A paid day off on the public holiday
pl: • Płatnego dnia urlopu wypadającego w święto państwowe

source: • An additional day of annual leave
pl: • Dodatkowego dnia urlopu wypoczynkowego

source: • An additional day's pay
pl: • Dodatkowego wynagrodzenia za dzień wolny

source: • A paid day off within a month of the public holiday
pl: • Płatnego dnia wolnego w ciągu miesiąca od święta państwowego

source: The Organisation of Working Time Act provides that you may ask your employer at least 21 days before a public holiday, which of the alternatives will apply
pl: Na mocy Ustawy o organizacji czasu pracy pracownik może z przynajmniej 21-dniowym wyprzedzeniem zwrócić się do pracodawcy z pytaniem, która z wyżej wymienionych możliwości jest brana pod uwagę

source: If your employer fails to respond at least 14 days before the public holiday, you are entitled to take the actual public holiday as a paid day off. The Organisation of Working Time (Determination of Pay For Holidays) Regulations (SI 475/1997) set out the appropriate rate of daily pay
pl: Jeśli pracodawca nie odpowie na przynajmniej 14 dni przed dniem ustawowo wolnym od pracy, pracownik ma prawo wziąć dzień płatnego urlopu w dniu, w którym wypada dzień ustawowo wolny od pracy

source: If you have worked for your employer at least 40 hours in the 5 weeks before the public holiday and the public holiday falls on a day you normally work you are entitled to a day's pay for the public holiday
pl: Jeśli w ciągu ostatnich 5 tygodni przed świętem państwowym przepracowałeś dla swojego pracodawcy co najmniej 40 godzin a święto państwowe wypada w dzień, w który normalnie pracujesz, masz prawo do wynagrodzenia za ten dzień

source: If you are required to work that day you are entitled to an additional day's pay
pl: Jeśli w ten dzień musisz pracować, masz prawo do dodakowego wynagrodzenia za ten dzień

source: If you do not normally work on that particular day you should receive one-fifth of your weekly pay
pl: Jeśli w ten dzień normalnie nie pracujesz, powinieneś otrzymać jedną piątą tygodniowej wypłaty

source: If you do not have normal daily or weekly working hours, under SI 475/1997, an average of your day’s pay or the fifth of your weekly pay is calculated over the 13 weeks you worked before the public holiday
pl: Nawet jeśli nigdy nie będzie wymagane od Ciebie pojawienie się w pracy w dzień święta państwowego, nadal masz prawo do jednej piątej Twojej tygodniowej wypłaty w ramach rekompensaty za święto państwowe

source: In all of the above situations your employer may choose to give you paid time off instead of pay for the public holiday
pl: We wszystkich powyższych sytuacjach Twój pracodawca może wybrać opcję płatnego dnia wolnego dla pracownika zamiast wynagrodzenia za święto państwowe

source: Sick leave on a public holiday
pl: Urlop zdrowotny w trakcie dni ustawowo wolnych od pracy

source: If you are a full time worker on sick leave during a public holiday, you are entitled to benefit for the public holiday you missed, as described above
pl: Osoby pracujące w pełnym wymiarze godzin oraz przebywające na urlopie zdrowotnym w dniu ustawowo wolnym od pracy mają prawo do odebrania dnia wolnego

source: If you are a part-time worker on sick leave during a public holiday, you would be entitled to benefit for the public holiday, provided you had worked for your employer for at least 40 hours in the previous five-week period - see 'Part-time employees' above
pl: Osoby pracujące w niepełnym wymiarze godzin przebywające na zwolnieniu lekarskim podczas dnia ustawowo wolnego od pracy, mają prawo do odebrania dnia wolnego, pod warunkiem że w okresie 5 tygodni poprzedzających ten dzień pracowały po 40 godzin tygodniowo

source: Absence from work and public holiday entitlement
pl: Nieobecność w pracy oraz uprawnienia związane z świętami państwowymi

source: You are entitled to leave for any public holidays that occur while you are on maternity leave, parental leave or adoptive leave
pl: Osoby przebywające na urlopie macierzyńskim, wychowawczym lub adopcyjnym mają prawo do urlopu w dni ustawowo wolne od pracy

source: These rights are set down in law in the Maternity Protection Acts 1994 and 2004, the Parental Leave Acts 1998 and 2006, and the Adoptive Leave Acts 1995 and 2005 respectively
pl: Te prawa zostały określone w Ustawach o ochronie macierzyństwa z lat 1994 i 2004, Ustawie o urlopie wychowawczym z 1998 roku,i Ustawie o urlopie adopcyjnym z 1995 roku

source: You are not entitled to public holiday benefits if you have been absent from work immediately before the public holiday and your absence is:
pl: Nie jesteś uprawniony do korzystania ze świadczeń związanych ze świętami państwowymi w sytuacji, jeśli byłeś nieobecny w pracy bezpośrednio przed samym świętem państwowym a Twoja nieobecność:

source: • Over 13 weeks, due to lay off or some other reason and authorised by your employer
pl: • Trwała ponad 13 tygodni z powodu tymczasowego zwolnienia z pracy lub innego powodu autoryzowanego przez Twojego pracodawcę

source: • After the first 13 weeks of carer's leave
pl: • Trwała 13 tygodni i była związana ze zwolnieniem L4 celem opieki nad bliską osobą

source: If your employment finishes during the week ending on the day before a public holiday and you have worked for your employer for the previous 4 weeks, you should receive an additional day's pay for the public holiday
pl: Jeśli Twój stosunek pracy kończy się w weekend poprzedzający święto państwowe a Ty przepracowałeś dla swojego pracodawcy 4 ostatnie tygodnie, powinieneś otrzymać dodatkowy dzień płatny za to święto państwowe

source: This also applies to part-time employees who have established a right to the public holiday by working at least 40 hours in the previous 5 weeks. You can read more about this in 'Further information' below
pl: Zasada ta obejmuje także pracowników pracujących na pół etatu, którzy nabyli prawo do święta państwowego przepracowawszy co najmniej 40 godzin w ostatnich 5 tygodni

source: Public holidays falling on a weekend
pl: Dni ustawowo wolne od pracy przypadające w weekend

source: Where a public holiday falls on a weekend, you do not have any automatic legal entitlement to have the next working day off work
pl: Jeśli dzień ustawowo wolny od pracy przypada w weekend, pracownicy nie nabywają automatycznie prawa do odebrania dnia wolnego następnego dnia

source: This occurred in 2016/2017 when Christmas Day (25 December) and New Year's Day (1 January) fell on a Sunday
pl: Taka sytuacja miała miejsce w 2013 roku, kiedy to pierwszy Dzień Św. Patryka (17 marca) przypadł w niedzielę

source: You can find out more about your public holiday entitlement for your individual working arrangement in this explanatory booklet on holidays and public holidays (pdf)
pl: W takiej sytuacji pracownik ma prawo do zwykłych alternatywnych rozwiązań związanych z zatrudnieniem i dniami ustawowo wolnymi od pracy, tj. przysługuje mu:

source: If you are not getting your public holiday entitlement you may make a complaint under the Organisation of Working Time Act within 6 months of the dispute or complaint occurring
pl: Możesz uzyskać więcej informacji na temat świąt państwowych w tej publikacji informacyjnej dotyczącej urlopów i świąt państwowych (pdf) lub bezpośrednio w Biurze Obsługi ds

source: You must use the online complaint form available on workplacerelations.ie
pl: Relacji w Miejscu Pracy – poniżej zapoznaj się z sekcją “Gdzie składać prośbę”

source: The time limit may be extended for up to a further 6 months, but only where there is a reasonable cause which prevented the complaint being brought within the normal time limit
pl: Jeśli nie otrzymałeś uprawnień do skorzystania ze świąt państwowych, możesz złożyć skargę zgodnie z Ustawą o Organizacji Czasu Pracy korzystając z nowego, pojedynczego formularza skarg (pdf)
